CSI API ETABS v1
cCaseStaticNonlinearStaged Interface
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public interface cCaseStaticNonlinearStaged
Public Interface cCaseStaticNonlinearStaged
Dim instance As cCaseStaticNonlinearStaged
public interface class cCaseStaticNonlinearStaged
type cCaseStaticNonlinearStaged =  interface end
The cCaseStaticNonlinearStaged type exposes the following members.
Methods
Name | Description
GetGeometricNonlinearity
GetHingeUnloading
GetInitialCase
GetMassSource
GetMaterialNonlinearity
GetResultsSaved
GetSolControlParameters
GetStageData
GetStageData_1
 Retrieves stage data for the specified stage in the specified load case
GetStageData_2
 Retrieves stage data for the specified stage in the specified load case
GetStageDefinitions
GetStageDefinitions_1
 Retrieves the stage definition data for the specified load case
GetStageDefinitions_2
 Retrieves the stage definition data for the specified load case
GetTargetForceParameters
SetCase
SetGeometricNonlinearity
SetHingeUnloading
SetInitialCase
SetMassSource
SetMaterialNonlinearity
SetResultsSaved
SetSolControlParameters
SetStageData
SetStageData_1
SetStageData_2
SetStageDefinitions
SetStageDefinitions_1
SetStageDefinitions_2
SetTargetForceParameters
Top
See Also
Reference
ETABSv1 Namespace